{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 404,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: SPARQLWrapper in c:\\users\\aleja\\anaconda3\\lib\\site-packages (1.8.5)\n",
      "Requirement already satisfied: rdflib>=4.0 in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from SPARQLWrapper) (5.0.0)\n",
      "Requirement already satisfied: pyparsing in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from rdflib>=4.0->SPARQLWrapper) (2.4.0)\n",
      "Requirement already satisfied: six in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from rdflib>=4.0->SPARQLWrapper) (1.14.0)\n",
      "Requirement already satisfied: isodate in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from rdflib>=4.0->SPARQLWrapper) (0.6.0)\n",
      "Requirement already satisfied: wikipedia in c:\\users\\aleja\\anaconda3\\lib\\site-packages (1.4.0)\n",
      "Requirement already satisfied: requests<3.0.0,>=2.0.0 in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from wikipedia) (2.23.0)\n",
      "Requirement already satisfied: beautifulsoup4 in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from wikipedia) (4.7.1)\n",
      "Requirement already satisfied: chardet<4,>=3.0.2 in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from requests<3.0.0,>=2.0.0->wikipedia) (3.0.4)\n",
      "Requirement already satisfied: idna<3,>=2.5 in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from requests<3.0.0,>=2.0.0->wikipedia) (2.9)\n",
      "Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from requests<3.0.0,>=2.0.0->wikipedia) (1.25.8)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from requests<3.0.0,>=2.0.0->wikipedia) (2019.11.28)\n",
      "Requirement already satisfied: soupsieve>=1.2 in c:\\users\\aleja\\anaconda3\\lib\\site-packages (from beautifulsoup4->wikipedia) (1.8)\n"
     ]
    }
   ],
   "source": [
    "# En primer lugar se instalan e importan las librerías y dependencias que serán utilizadas en el proceso.\n",
    "!pip install SPARQLWrapper  \n",
    "!pip install wikipedia      \n",
    "import pandas as pd\n",
    "from pandas.io.json import json_normalize\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON, XML\n",
    "import wikipedia\n",
    "import json\n",
    "import xml.etree.ElementTree as ET\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 405,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "¿Cual es el identificador de la clase del cual se quiere generar un diagrama?\n",
      "Q349\n",
      "¿Cual es el idioma en el que quieres generar el diagrama (ES:español, EN:ingles, ...)?\n",
      "ES\n"
     ]
    }
   ],
   "source": [
    "# A continuación se pregunta al usuario por el identificador de la clase del cual se quiere generar un diagrama\n",
    "print(\"¿Cual es el identificador de la clase del cual se quiere generar un diagrama?\")\n",
    "clase = input()\n",
    "print(\"¿Cual es el idioma en el que quieres generar el diagrama (ES:español, EN:ingles, ...)?\")\n",
    "idioma = input()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 406,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Se define la función para consultar Wikidata. Se consulta el endpoint señalado y \n",
    "#devuelve los resultados como un DataFrame de Pandas.\n",
    "\n",
    "def query_wikidata(sparql_query, sparql_service_url):        \n",
    "  \n",
    "    # crear la conexión con el endpoint\n",
    "    sparql = SPARQLWrapper(sparql_service_url)    \n",
    "    sparql.setQuery(sparql_query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "\n",
    "    # solicitar resultados\n",
    "    result = sparql.query().convert()\n",
    "    return json_normalize(result[\"results\"][\"bindings\"])\n",
    "\n",
    "#Se genera la consulta para obtener el numero de instancias de la clase a representar\n",
    "sparql_query1 = \"\"\"SELECT DISTINCT ?clase ?claseLabel\n",
    "WHERE {\n",
    "?clase wdt:P31 wd:\"\"\"+clase+\"\"\".\n",
    "SERVICE wikibase:label { bd:serviceParam wikibase:language \"es\". }\n",
    "}\n",
    "\"\"\"\n",
    "#para consultar otro endpoint, cambiar la URL del servicio y la consulta.\n",
    "sparql_service_url = \"https://query.wikidata.org/sparql\"\n",
    "instancias_wikidata = query_wikidata(sparql_query1, sparql_service_url)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 407,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>clase.type</th>\n",
       "      <th>clase.value</th>\n",
       "      <th>claseLabel.type</th>\n",
       "      <th>claseLabel.value</th>\n",
       "      <th>claseLabel.xml:lang</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q581356</td>\n",
       "      <td>literal</td>\n",
       "      <td>Q581356</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q627949</td>\n",
       "      <td>literal</td>\n",
       "      <td>Q627949</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q638269</td>\n",
       "      <td>literal</td>\n",
       "      <td>Q638269</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q895138</td>\n",
       "      <td>literal</td>\n",
       "      <td>Q895138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q907328</td>\n",
       "      <td>literal</td>\n",
       "      <td>Q907328</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  clase.type                             clase.value claseLabel.type  \\\n",
       "0        uri  http://www.wikidata.org/entity/Q581356         literal   \n",
       "1        uri  http://www.wikidata.org/entity/Q627949         literal   \n",
       "2        uri  http://www.wikidata.org/entity/Q638269         literal   \n",
       "3        uri  http://www.wikidata.org/entity/Q895138         literal   \n",
       "4        uri  http://www.wikidata.org/entity/Q907328         literal   \n",
       "\n",
       "  claseLabel.value claseLabel.xml:lang  \n",
       "0          Q581356                 NaN  \n",
       "1          Q627949                 NaN  \n",
       "2          Q638269                 NaN  \n",
       "3          Q895138                 NaN  \n",
       "4          Q907328                 NaN  "
      ]
     },
     "execution_count": 407,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Se confirma que la consulta haya salido bien\n",
    "instancias_wikidata.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 408,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "203"
      ]
     },
     "execution_count": 408,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Se obtiene el numero de instancias de la clase de entrada\n",
    "numero_de_instancias = instancias_wikidata.shape[0]\n",
    "numero_de_instancias"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 409,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Se genera la consulta para obtener las propiedades de la clase de entrada\n",
    "sparql_query2 = \"\"\"SELECT DISTINCT ?p ?pLabel\n",
    "WHERE {\n",
    "?clase wdt:P31 wd:\"\"\"+clase+\"\"\";\n",
    "?p ?x.\n",
    "#to obtain property labels:\n",
    "?property wikibase:directClaim ?p\n",
    "#to obtain labels in spanish:\n",
    "SERVICE wikibase:label { bd:serviceParam wikibase:language \"es\". }\n",
    "}   \n",
    "    \"\"\"\n",
    "#para consultar otro endpoint, cambiar la URL del servicio y la consulta.\n",
    "sparql_service_url = \"https://query.wikidata.org/sparql\"\n",
    "propiedades_wikidata = query_wikidata(sparql_query2, sparql_service_url)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 410,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.type</th>\n",
       "      <th>p.value</th>\n",
       "      <th>pLabel.type</th>\n",
       "      <th>pLabel.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P279</td>\n",
       "      <td>literal</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P279</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P276</td>\n",
       "      <td>literal</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P276</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P349</td>\n",
       "      <td>literal</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P349</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P373</td>\n",
       "      <td>literal</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P373</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P495</td>\n",
       "      <td>literal</td>\n",
       "      <td>http://www.wikidata.org/prop/direct/P495</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  p.type                                   p.value pLabel.type  \\\n",
       "0    uri  http://www.wikidata.org/prop/direct/P279     literal   \n",
       "1    uri  http://www.wikidata.org/prop/direct/P276     literal   \n",
       "2    uri  http://www.wikidata.org/prop/direct/P349     literal   \n",
       "3    uri  http://www.wikidata.org/prop/direct/P373     literal   \n",
       "4    uri  http://www.wikidata.org/prop/direct/P495     literal   \n",
       "\n",
       "                               pLabel.value  \n",
       "0  http://www.wikidata.org/prop/direct/P279  \n",
       "1  http://www.wikidata.org/prop/direct/P276  \n",
       "2  http://www.wikidata.org/prop/direct/P349  \n",
       "3  http://www.wikidata.org/prop/direct/P373  \n",
       "4  http://www.wikidata.org/prop/direct/P495  "
      ]
     },
     "execution_count": 410,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Se confirma que la consulta haya salido bien\n",
    "propiedades_wikidata.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 411,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "106\n"
     ]
    }
   ],
   "source": [
    "#Se genera la consulta para obtener las propiedades de la clase.\n",
    "sparql_query2 = \"\"\"SELECT DISTINCT ?p ?pLabel\n",
    "WHERE {\n",
    "?clase wdt:P31 wd:\"\"\"+clase+\"\"\";\n",
    "?p ?x.\n",
    "#to obtain property labels:\n",
    "?property wikibase:directClaim ?p\n",
    "#to obtain labels in spanish:\n",
    "SERVICE wikibase:label { bd:serviceParam wikibase:language \"es\". }\n",
    "}   \n",
    "    \"\"\"\n",
    "#para consultar otro endpoint, cambiar la URL del servicio y la consulta.\n",
    "sparql_service_url = \"https://query.wikidata.org/sparql\"\n",
    "propiedades_wikidata = query_wikidata(sparql_query2, sparql_service_url)\n",
    "\n",
    "#Se listan las propiedades de salida de la clase y se le asignan a la variable \"lista_propiedades\"\n",
    "lista_completa = propiedades_wikidata[\"p.value\"].tolist()\n",
    "lista_propiedades = []\n",
    "for ele in lista_completa:\n",
    "    ele = ele[36:]\n",
    "    lista_propiedades.append(ele)\n",
    "print(len(lista_propiedades))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 412,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['P276', ['Q82794'], 'P495', ['Q6256', 'Q3024240'], 'P641', ['Q31629'], 'P910', ['Q4167836'], 'P6104', ['Q16695773'], 'P17', ['Q6256', 'Q43702', 'Q3024240'], 'P452', ['Q268592', 'Q8187769'], 'P3719', ['Q43229'], 'P488', ['Q5'], 'P2596', ['Q41710'], 'P170', ['Q5']]\n"
     ]
    }
   ],
   "source": [
    "lista_resultado_propiedades_clases = []\n",
    "#Para cada propiedad de la lista:\n",
    "for prop in lista_propiedades:\n",
    "    \n",
    "    #Se obtienen de las propiedades anteriores aquellas que son object properties. Se almacenan en una lista.\n",
    "    #Aquí se genera la consulta. Esta se hace para ver si la propiedad con la que se esta tratando es object property o no.\n",
    "    sparql= SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "    sparql.setQuery(\"\"\"ASK WHERE {\n",
    "    wdt:\"\"\"+prop+\"\"\" rdf:type owl:ObjectProperty\n",
    "    }   \n",
    "    \"\"\")\n",
    "    sparql.setReturnFormat(XML)\n",
    "    results = sparql.query().convert()\n",
    "    string = results.toxml()\n",
    "    \n",
    "    #Se obtiene el valor booleano del xml string, siendo este \"true\" en caso afirmativo\n",
    "    es_OP = string[105:109]\n",
    "    \n",
    "    #En caso de que la variable es_OP sea \"true\", es decir la propiedad sea object propery:\n",
    "    if es_OP == \"true\":\n",
    "        \n",
    "        #Se genera la consulta. Se realiza esta consulta para obtener las clases que pertenecen a dicha propiedad.\n",
    "        #Se realiza esta consulta para todas las object properties encontradas anteriormente.\n",
    "        sparql1 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        sparql1.setQuery(\"\"\"\n",
    "        SELECT DISTINCT ?claseInicial ?claseInicialLabel ?prop ?propLabel ?Clase ?ClaseLabel\n",
    "        WHERE {\n",
    "        #occupation (P106) must be Formula 1 driver (Q10841764)\n",
    "        ?claseInicial wdt:P31 wd:\"\"\"+clase+\"\"\" .\n",
    "        ?claseInicial wdt:\"\"\"+prop +\"\"\" ?prop .\n",
    "        ?prop wdt:P31 ?Clase .\n",
    "        #to obtain labels in spanish:\n",
    "        SERVICE wikibase:label { bd:serviceParam wikibase:language \"es\". }\n",
    "        }  \n",
    "        \"\"\")\n",
    "        sparql1.setReturnFormat(JSON)\n",
    "        results = sparql1.query().convert()\n",
    "        \n",
    "        #Se añade a la lista \"lista_clases_para_una_propiedad_completo\" todas las clases que resultan de la consulta anterior. \n",
    "        lista_clases_para_una_propiedad_completo = []\n",
    "        for result in results[\"results\"][\"bindings\"]:\n",
    "            lista_clases_para_una_propiedad_completo.append(result[\"Clase\"][\"value\"])\n",
    "        \n",
    "        #Al tener estos valores en su inicio la URL \"https:..\", esto se elimina dejando solo el identificador de la clase.\n",
    "        lista_clases_para_una_propiedad = []\n",
    "        for ele in lista_clases_para_una_propiedad_completo:\n",
    "            ele = ele[31:]\n",
    "            lista_clases_para_una_propiedad.append(ele)\n",
    "        \n",
    "        #Se tiene la lista \"lista_clases_para_una_propiedad\" en la cual se encuentran todas las clases de la propiedad \n",
    "        #estudiada.\n",
    "        \n",
    "        #Se obtienen las value type constraint de las propiedades. La consulta siguiente las obtiene.\n",
    "        sparql2 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        sparql2.setQuery(\"\"\"SELECT ?Property_ ?Property_Label ?Property_Description ?class_ ?class_Label ?relation_ ?relation_Label\n",
    "        WHERE {\n",
    "        ?Property_ wikibase:directClaim wdt:\"\"\"+prop+\"\"\" .\n",
    "        ?Property_ p:P2302 ?constraint_statement .\n",
    "        ?constraint_statement ps:P2302 wd:Q21510865 .\n",
    "        OPTIONAL {?constraint_statement pq:P2308 ?class_ .}\n",
    "        OPTIONAL {?constraint_statement pq:P2309 ?relation_ .}\n",
    "\n",
    "        SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "        } \n",
    "        \"\"\")\n",
    "        sparql2.setReturnFormat(JSON)\n",
    "        results = sparql2.query().convert()\n",
    "\n",
    "        #En la lista \"lista_value_type_constraints_completa\" se almacenan todas las value type constraint de la propiedad \n",
    "        #estudiada.\n",
    "        lista_value_type_constraints_completa = []\n",
    "        for result in results[\"results\"][\"bindings\"]:\n",
    "            lista_value_type_constraints_completa.append(result[\"class_\"][\"value\"])\n",
    "            \n",
    "        #Al tener estos valores en su inicio la URL \"https:..\", esto se elimina dejando solo el identificador de la clase.\n",
    "        lista_value_type_constraints = []\n",
    "        for ele in lista_value_type_constraints_completa:\n",
    "            ele = ele[31:]\n",
    "            lista_value_type_constraints.append(ele)\n",
    "        \n",
    "        #Se tiene la lista \"lista_value_type_constraints\" con las value type constraint de la propiedad estudiada.\n",
    "        if (lista_clases_para_una_propiedad != []) & (lista_value_type_constraints != []):\n",
    "            #Se guardan en la lista \"lista_clases_a_representar\" aquellos identificadores que esten en ambas listas.\n",
    "            lista_clases_a_representar = []\n",
    "            for ele_VTC in lista_value_type_constraints:\n",
    "                for ele_CPUP in lista_clases_para_una_propiedad:\n",
    "                    if ele_VTC == ele_CPUP:\n",
    "                        lista_clases_a_representar.append(ele_VTC)\n",
    "            \n",
    "            #Se tiene la lista \"lista_clases_a_representar\" con las clases que hay que representar para la propiedad estudiada.\n",
    "            \n",
    "            #Se eliminan los duplicados\n",
    "            if lista_clases_a_representar != []:             \n",
    "                result = []\n",
    "                for ele in lista_clases_a_representar:\n",
    "                    if ele not in result:\n",
    "                        result.append(ele)\n",
    "                        \n",
    "                #Se añade a la lista final el valor de la propiedad\n",
    "                lista_resultado_propiedades_clases.append(prop)\n",
    "                \n",
    "                result2 = result\n",
    "                result3 = result\n",
    "                #Se eliminan las clases que sean subclases de otra clase de la misma lista\n",
    "                if len(result) != 1:\n",
    "                    for ele in result:\n",
    "                        #Se obtienen las subclases de la clase ele\n",
    "                        sparql3 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "                        sparql3.setQuery(\"\"\"SELECT ?s ?desc\n",
    "                        WHERE{\n",
    "                        ?s wdt:P279+ wd:\"\"\"+ele+\"\"\" .\n",
    "                        OPTIONAL {\n",
    "                        ?s rdfs:label ?desc filter (lang(?desc) = \"es\").}\n",
    "                        }\n",
    "                        \"\"\")\n",
    "                        sparql3.setReturnFormat(JSON)\n",
    "                        results = sparql3.query().convert()\n",
    "\n",
    "                        #En la lista \"lista_value_type_constraints_completa\" se almacenan todas las value type constraint de \n",
    "                        #la propiedad estudiada.\n",
    "                        lista_subclases_de_ele_completa = []\n",
    "                        for result in results[\"results\"][\"bindings\"]:\n",
    "                            lista_subclases_de_ele_completa.append(result[\"s\"][\"value\"])\n",
    "                           \n",
    "                        #Al tener estos valores en su inicio la URL \"https:..\", esto se elimina dejando solo el identificador \n",
    "                        #de la clase.\n",
    "                        lista_subclases_de_ele = []\n",
    "                        for ele2 in lista_subclases_de_ele_completa:\n",
    "                            ele2 = ele2[31:]\n",
    "                            lista_subclases_de_ele.append(ele2)\n",
    "                          \n",
    "                        #Se comparan todos los elementos de la lista \"result2\" con los de la lista \"lista_subclase_de_ele\" y \n",
    "                        #se eliman de la lista final si estos son iguales.\n",
    "                        for ele4 in result2:\n",
    "                            for ele3 in lista_subclases_de_ele:\n",
    "                                if ele4 == ele3:\n",
    "                                    result3.remove(ele4)\n",
    "                \n",
    "                #Se añaden las listas con las clases a representar en la lista final.\n",
    "                lista_resultado_propiedades_clases.append(result3)\n",
    "    \n",
    "                \n",
    "#Se imprime la lista resultado final con las propiedades a representar y sus respectivas clases\n",
    "print(lista_resultado_propiedades_clases)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 413,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[['Q5'], 'P488', 'P170']\n",
      "\n",
      "\n",
      "['P276', ['Q82794'], 'P495', ['Q6256', 'Q3024240'], 'P641', ['Q31629'], 'P910', ['Q4167836'], 'P6104', ['Q16695773'], 'P17', ['Q6256', 'Q43702', 'Q3024240'], 'P452', ['Q268592', 'Q8187769'], 'P3719', ['Q43229'], 'P2596', ['Q41710']]\n"
     ]
    }
   ],
   "source": [
    "#Se generan las listas \"lista_varias_propiedades_una_clase\" y \"lista_varias_clases_una_propiedad\".\n",
    "#En la primera aparecen todas las propiedades que apuntan a una sola clase.\n",
    "#En la segunda aparecen todas las clases a las que apunta una sola propiedad.\n",
    "result = []\n",
    "result2 = []\n",
    "for ele in range(0,len(lista_resultado_propiedades_clases)):\n",
    "    if lista_resultado_propiedades_clases[ele] not in result:\n",
    "        result.append(lista_resultado_propiedades_clases[ele])\n",
    "    else:\n",
    "        if lista_resultado_propiedades_clases[ele] not in result2:\n",
    "            result2.append(lista_resultado_propiedades_clases[ele])\n",
    "            m=[i for i,x in enumerate(lista_resultado_propiedades_clases) if x==lista_resultado_propiedades_clases[ele]]\n",
    "            for i in m:\n",
    "                result2.append(lista_resultado_propiedades_clases[i-1])\n",
    "\n",
    "lista_varias_propiedades_una_clase = result2\n",
    "lista_varias_clases_una_propiedad = lista_resultado_propiedades_clases\n",
    "\n",
    "def eliminar_valores_de_una_lista(the_list, val):\n",
    "    return [value for value in the_list if value != val]\n",
    "\n",
    "for x in lista_varias_clases_una_propiedad:\n",
    "    for y in lista_varias_propiedades_una_clase:\n",
    "        if x == y:\n",
    "            lista_varias_clases_una_propiedad = eliminar_valores_de_una_lista(lista_varias_clases_una_propiedad, y)\n",
    "\n",
    "print(lista_varias_propiedades_una_clase)\n",
    "print(\"\\n\")\n",
    "print(lista_varias_clases_una_propiedad)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 414,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[['ser humano (Q5)'], 'presidente (P488)', 'creador (P170)']\n",
      "\n",
      "\n",
      "['ubicación (P276)', ['región geográfica (Q82794)'], 'país de origen (P495)', ['país (Q6256)', 'Estado desaparecido (Q3024240)'], 'deporte (P641)', ['tipo de deporte (Q31629)'], 'categoría principal del tema (P910)', ['categoría de Wikimedia (Q4167836)'], 'mantenido por el wikiproyecto (P6104)', ['wikiproyecto (Q16695773)'], 'país (P17)', ['país (Q6256)', 'federación (Q43702)', 'Estado desaparecido (Q3024240)'], 'industria (P452)', ['industria (Q268592)', 'actividad económica (Q8187769)'], 'regulado por (P3719)', ['organización (Q43229)'], 'cultura (P2596)', ['etnia (Q41710)']]\n"
     ]
    }
   ],
   "source": [
    "#Se busca la etiqueta de cada uno de los elementos de las dos listas y se superponen al identificador anterior\n",
    "for pos in range(0,len(lista_varias_propiedades_una_clase)):\n",
    "    res = isinstance(lista_varias_propiedades_una_clase[pos], str) \n",
    "    #Para las propiedades\n",
    "    if str(res) == \"True\":\n",
    "        #Se obtienen las subclases de la clase ele\n",
    "        sparql4 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        sparql4.setQuery(\"\"\"SELECT  *\n",
    "        WHERE {\n",
    "        wd:\"\"\"+lista_varias_propiedades_una_clase[pos]+\"\"\" rdfs:label ?label .\n",
    "        FILTER (langMatches( lang(?label),'\"\"\"+idioma+\"\"\"' ) )\n",
    "        } \n",
    "        LIMIT 1\n",
    "        \"\"\")\n",
    "        sparql4.setReturnFormat(JSON)\n",
    "        results = sparql4.query().convert()\n",
    "        lista_label = []\n",
    "        for result in results[\"results\"][\"bindings\"]:\n",
    "            lista_label.append(result[\"label\"][\"value\"])\n",
    "        for ele2 in lista_label:\n",
    "            label = ele2\n",
    "        label = label + \" (\"+lista_varias_propiedades_una_clase[pos]+\")\"\n",
    "        lista_varias_propiedades_una_clase[pos] = label\n",
    "    #Para las listas de clases\n",
    "    else:\n",
    "        for ele in range(0,len(lista_varias_propiedades_una_clase[pos])):\n",
    "           #Se obtienen las subclases de la clase ele\n",
    "            sparql4 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "            sparql4.setQuery(\"\"\"SELECT  *\n",
    "            WHERE {\n",
    "            wd:\"\"\"+lista_varias_propiedades_una_clase[pos][ele]+\"\"\" rdfs:label ?label .\n",
    "            FILTER (langMatches( lang(?label), '\"\"\"+idioma+\"\"\"' ) )\n",
    "            } \n",
    "            LIMIT 1\n",
    "            \"\"\")\n",
    "            sparql4.setReturnFormat(JSON)\n",
    "            results = sparql4.query().convert()\n",
    "            lista_label = []\n",
    "            for result in results[\"results\"][\"bindings\"]:\n",
    "                lista_label.append(result[\"label\"][\"value\"])\n",
    "            for ele2 in lista_label:\n",
    "                label = ele2\n",
    "            label = label + \" (\"+lista_varias_propiedades_una_clase[pos][ele]+\")\"\n",
    "            lista_varias_propiedades_una_clase[pos][ele] = label \n",
    "\n",
    "for pos in range(0,len(lista_varias_clases_una_propiedad)):\n",
    "    res = isinstance(lista_varias_clases_una_propiedad[pos], str) \n",
    "    #Para las propiedades\n",
    "    if str(res) == \"True\":\n",
    "        #Se obtienen las subclases de la clase ele\n",
    "        sparql4 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        sparql4.setQuery(\"\"\"SELECT  *\n",
    "        WHERE {\n",
    "        wd:\"\"\"+lista_varias_clases_una_propiedad[pos]+\"\"\" rdfs:label ?label .\n",
    "        FILTER (langMatches( lang(?label), '\"\"\"+idioma+\"\"\"' ) )\n",
    "        } \n",
    "        LIMIT 1\n",
    "        \"\"\")\n",
    "        sparql4.setReturnFormat(JSON)\n",
    "        results = sparql4.query().convert()\n",
    "        lista_label = []\n",
    "        for result in results[\"results\"][\"bindings\"]:\n",
    "            lista_label.append(result[\"label\"][\"value\"])\n",
    "        for ele2 in lista_label:\n",
    "            label = ele2\n",
    "        label = label + \" (\"+lista_varias_clases_una_propiedad[pos]+\")\"\n",
    "        lista_varias_clases_una_propiedad[pos] = label\n",
    "    #Para las listas de clases\n",
    "    else:\n",
    "        for ele in range(0,len(lista_varias_clases_una_propiedad[pos])):\n",
    "           #Se obtienen las subclases de la clase ele\n",
    "            sparql5 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "            sparql5.setQuery(\"\"\"SELECT  *\n",
    "            WHERE {\n",
    "            wd:\"\"\"+lista_varias_clases_una_propiedad[pos][ele]+\"\"\" rdfs:label ?label .\n",
    "            FILTER (langMatches( lang(?label), '\"\"\"+idioma+\"\"\"' ) )\n",
    "            } \n",
    "            LIMIT 1\n",
    "            \"\"\")\n",
    "            sparql5.setReturnFormat(JSON)\n",
    "            results = sparql5.query().convert()\n",
    "            lista_label = []\n",
    "            for result in results[\"results\"][\"bindings\"]:\n",
    "                lista_label.append(result[\"label\"][\"value\"])\n",
    "            for ele2 in lista_label:\n",
    "                label = ele2\n",
    "            label = label + \" (\"+lista_varias_clases_una_propiedad[pos][ele]+\")\"\n",
    "            lista_varias_clases_una_propiedad[pos][ele] = label \n",
    "        \n",
    "print(lista_varias_propiedades_una_clase)\n",
    "print(\"\\n\")\n",
    "print(lista_varias_clases_una_propiedad)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 415,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['P279', 'P276', 'P349', 'P373', 'P495', 'P527', 'P571', 'P585', 'P646', 'P641', 'P664', 'P691', 'P910', 'P935', 'P1014', 'P1051', 'P1245', 'P1296', 'P1417', 'P1872', 'P1873', 'P2167', 'P2283', 'P2347', 'P2671', 'P2910', 'P2924', 'P2959', 'P3095', 'P3221', 'P3417', 'P3509', 'P3827', 'P4235', 'P4613', 'P4854', 'P5160', 'P5250', 'P5429', 'P6104', 'P6262', 'P7033', 'P7749', 'P7818', 'P8309', 'P8408', 'P8785', 'P18', 'P17', 'P31', 'P227', 'P452', 'P582', 'P580', 'P740', 'P989', 'P1889', 'P2541', 'P3719', 'P4212', 'P5513', 'P244', 'P361', 'P856', 'P2013', 'P3338', 'P6366', 'P8814', 'P138', 'P186', 'P508', 'P1269', 'P5082', 'P460', 'P488', 'P797', 'P1705', 'P3259', 'P443', 'P625', 'P1132', 'P1350', 'P1807', 'P2348', 'P3450', 'P407', 'P461', 'P937', 'P1433', 'P2002', 'P2003', 'P2397', 'P2521', 'P2596', 'P5916', 'P10', 'P21', 'P127', 'P159', 'P170', 'P421', 'P1282', 'P2561', 'P2581', 'P6766', 'P131']\n",
      "106\n",
      "['P279', 'P276', 'P495', 'P527', 'P571', 'P585', 'P641', 'P664', 'P910', 'P1872', 'P1873', 'P2167', 'P2283', 'P2910', 'P2959', 'P3095', 'P5160', 'P6104', 'P7033', 'P7749', 'P8309', 'P8785', 'P18', 'P17', 'P31', 'P452', 'P582', 'P580', 'P740', 'P989', 'P1889', 'P2541', 'P3719', 'P361', 'P856', 'P3338', 'P8814', 'P138', 'P186', 'P1269', 'P5082', 'P460', 'P488', 'P797', 'P1705', 'P3259', 'P443', 'P625', 'P1132', 'P1350', 'P2348', 'P3450', 'P407', 'P461', 'P937', 'P1433', 'P2521', 'P2596', 'P5916', 'P10', 'P21', 'P127', 'P159', 'P170', 'P421', 'P2561', 'P131']\n",
      "67\n"
     ]
    }
   ],
   "source": [
    "lista_a_no_representar = ['P646','P957','P1417','P3265','P3417','P3589','P7818','P212','P1274','P1296','P2638','P3365','P2671',\n",
    "                          'P6839','P244','P373','P2003','P2013','P2163','P3984','P4073','P214','P227','P1267','P7859','P268',\n",
    "                          'P4485','P8873','P6366','P345','P480','P648','P724','P905','P1258','P1265','P1970','P2334','P2465',\n",
    "                          'P2508','P2509','P2529','P2603','P2704','P3107','P3143','P3138','P3212','P3302','P3704','P3868',\n",
    "                          'P3933','P4277','P4282','P4529','P4947','P5032','P5786','P5849','P6127','P6133','P8033','P1392',\n",
    "                          'P1092','P5396','P2969','P8383','P7363','P236','P243','P2002','P5331','P5099','P3943','P6262','P8406',\n",
    "                          'P6947','P8687','P1273','P8179','P2397','P2635','P6981','P3959','P5749','P7704','P2687','P5733',\n",
    "                          'P1922','P3132','P6164','P8644','P1085','P3962','P1235','P3631','P6623','P675','P1984','P4087',\n",
    "                          'P5905','P1985','P5357','P2581','P3222','P3219','P4342','P5019','P7818','P8349','P244','P1036','P1430',\n",
    "                          'P7772','P8408','P7982','P2209','P2209','P9100','P935','P349','P691','P1014','P1051','P1245','P1417',\n",
    "                          'P2347','P2924','P3221','P3509','P3827','P4613','P4854','P5250','P5429','P4212','P5513','P508','P4235',\n",
    "                          'P1807','P2003','P1282','P6766']\n",
    "print(lista_propiedades)\n",
    "print(len(lista_propiedades))\n",
    "lista_propiedades_a_analizar=[]\n",
    "for prop in lista_propiedades:\n",
    "    if prop not in lista_a_no_representar:\n",
    "            lista_propiedades_a_analizar.append(prop)\n",
    "print(lista_propiedades_a_analizar)\n",
    "print(len(lista_propiedades_a_analizar))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 394,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['categoría en Commons (P373)', 'fecha de fundación o creación (P571)', 'fecha (P585)', 'identificador Tesauro de arte y arquitectura (P1014)', 'definición de significado de OmegaWiki (P1245)', 'identificador Enciclopedia Británica Online (P1417)', 'número mínimo de jugadores (P1872)', 'número máximo de jugadores (P1873)', 'Google Knowledge Graph (P2671)', 'identificador de tema en Quora (P3417)', 'identificador JSTOR de tema (P3827)', 'identificador Encyclopedia of Modern Ukraine (P4613)', 'newscode IPTC (P5429)', \"ID Enciclopèdia de l'Esport Català (P5513)\", 'fecha de fin (P582)', 'fecha de inicio (P580)', 'nombre en la lengua nativa (P1705)', 'coordenadas (P625)', 'número de participantes (P1132)', 'número de partidos jugados (P1350)', 'nombre de usuario de Instagram (P2003)', 'forma femenina de la etiqueta (P2521)', 'nombre (P2561)', 'identificador BabelNet (P2581)']\n",
      "['P373', 'P571', 'P585', 'P1014', 'P1245', 'P1417', 'P1872', 'P1873', 'P2671', 'P3417', 'P3827', 'P4613', 'P5429', 'P5513', 'P582', 'P580', 'P1705', 'P625', 'P1132', 'P1350', 'P2003', 'P2521', 'P2561', 'P2581']\n"
     ]
    }
   ],
   "source": [
    "#Se obtiene la lista de data properties\n",
    "lista_data_properties = []\n",
    "lista_data_properties_id = []\n",
    "for prop in lista_propiedades_a_analizar:        \n",
    "    sparql= SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "    sparql.setQuery(\"\"\"ASK WHERE {\n",
    "    wdt:\"\"\"+prop+\"\"\" rdf:type owl:ObjectProperty\n",
    "    }   \n",
    "    \"\"\")\n",
    "    sparql.setReturnFormat(XML)\n",
    "    results = sparql.query().convert()\n",
    "    string = results.toxml()\n",
    "    #Se obtiene el valor booleano del xml string, siendo este \"true\" en caso afirmativo\n",
    "    es_OP = string[105:110]\n",
    "    \n",
    "    #En caso de que la variable es_OP sea \"false\", es decir la propiedad sea data propery:\n",
    "    if es_OP == \"false\":\n",
    "        #Se obtienen las subclases de la clase ele\n",
    "        sparql5 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        sparql5.setQuery(\"\"\"SELECT  *\n",
    "        WHERE {\n",
    "        wd:\"\"\"+prop+\"\"\" rdfs:label ?label .\n",
    "        FILTER (langMatches( lang(?label), '\"\"\"+idioma+\"\"\"' ) )\n",
    "        } \n",
    "        LIMIT 1\n",
    "        \"\"\")\n",
    "        sparql5.setReturnFormat(JSON)\n",
    "        results = sparql5.query().convert()\n",
    "        lista_label = []\n",
    "        for result in results[\"results\"][\"bindings\"]:\n",
    "            lista_label.append(result[\"label\"][\"value\"])\n",
    "        if(lista_label != []):\n",
    "            for ele2 in lista_label:\n",
    "                label = ele2\n",
    "            label = label + \" (\"+prop+\")\"\n",
    "            lista_data_properties.append(label)\n",
    "            lista_data_properties_id.append(prop)\n",
    "print(lista_data_properties)\n",
    "print(lista_data_properties_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 379,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['P276', 3, 'P279', 84, 'P276', 3, 'P279', 84, 'P349', 3, 'P349', 3, 'P349', 3, 'P373', 88, 'P361', 3, 'P373', 88, 'P361', 3, 'P407', 2, 'P407', 2, 'P421', 1, 'P443', 1, 'P421', 1, 'P443', 1, 'P452', 1, 'P460', 1, 'P461', 1, 'P452', 1, 'P460', 1, 'P461', 1, 'P495', 9, 'P488', 1, 'P508', 1, 'P488', 1, 'P508', 1, 'P508', 1, 'P495', 9, 'P527', 3, 'P527', 3, 'P571', 11, 'P571', 11, 'P582', 2, 'P580', 5, 'P585', 3, 'P582', 2, 'P580', 5, 'P585', 3, 'P625', 1, 'P625', 1, 'P646', 101, 'P646', 101, 'P641', 39, 'P664', 4, 'P641', 39, 'P646', 101, 'P664', 4, 'P691', 1, 'P691', 1, 'P740', 2, 'P740', 2, 'P797', 2, 'P797', 2, 'P856', 7, 'P856', 7, 'P910', 56, 'P910', 56, 'P935', 6, 'P937', 1, 'P935', 6, 'P937', 1, 'P989', 3, 'P989', 3, 'P1014', 2, 'P1014', 2, 'P1014', 2, 'P1051', 1, 'P1051', 1, 'P1132', 2, 'P1132', 2, 'P1245', 1, 'P1245', 1, 'P1269', 2, 'P1269', 2, 'P1296', 3, 'P1282', 1, 'P1282', 1, 'P1296', 3, 'P1350', 1, 'P1350', 1, 'P1433', 2, 'P1417', 19, 'P1417', 19, 'P1433', 2, 'P1705', 3, 'P1705', 3, 'P1807', 1, 'P1807', 1, 'P1872', 1, 'P1873', 1, 'P1872', 1, 'P1873', 1, 'P1889', 7, 'P1889', 7, 'P2002', 1, 'P2003', 1, 'P2013', 2, 'P2002', 1, 'P21', 1, 'P31', 203, 'P18', 46, 'P10', 1, 'P17', 47, 'P31', 203, 's/core#altLabel', 126, 'P127', 2, 'P127', 2, 'P131', 2, 'P138', 2, 'P159', 1, 'P131', 2, 'P138', 2, 'P159', 1, 'P186', 1, 'P170', 1, 'ersion', 203, 'dified', 203, '', 147, 'P170', 1, 'P186', 1, 'a#label', 203, 'P227', 7, 'P227', 7, 'P244', 9, 'P227', 7, 'P244', 9, 'P244', 9, 'tements', 203, 'elinks', 203, 'estamp', 150, 'ers', 203, 'P2003', 1, 'P2013', 2, 'P2167', 2, 'P2167', 2, 'P2283', 14, 'P2283', 14, 'P2348', 2, 'P2347', 5, 'P2347', 5, 'P2347', 5, 'P2348', 2, 'P2397', 1, 'P2397', 1, 'P2521', 1, 'P2521', 1, 'P2541', 1, 'P2541', 1, 'P2561', 1, 'P2581', 1, 'P2581', 1, 'P2561', 1, 'P2581', 1, 'P2596', 2, 'P2596', 2, 'P2671', 17, 'P2671', 17, 'P2671', 17, 'P2910', 1, 'P2910', 1, 'P2924', 1, 'P2924', 1, 'P2959', 1, 'P2959', 1, 'P3095', 24, 'P3095', 24, 'P3221', 1, 'P3221', 1, 'P3259', 3, 'P3259', 3, 'P3338', 1, 'P3338', 1, 'P3417', 28, 'P3417', 28, 'P3450', 2, 'P3450', 2, 'P3509', 1, 'P3509', 1, 'P3719', 2, 'P3719', 2, 'P3827', 6, 'P3827', 6, 'P4212', 1, 'P4212', 1, 'P4235', 2, 'P4235', 2, 'P4613', 1, 'P4613', 1, 'P4854', 1, 'P4854', 1, 'P5082', 1, 'P5082', 1, 'P5160', 1, 'P5160', 1, 'P5250', 1, 'P5250', 1, 'P5429', 4, 'P5429', 4, 'P5429', 4, 'P5513', 8, 'P5513', 8, 'P5916', 1, 'P5916', 1, 'P6104', 1, 'P6104', 1, 'P6262', 1, 'P6262', 1, 'P6366', 2, 'P6366', 2, 'P6366', 2, 'P6766', 1, 'P6766', 1, 'P7033', 1, 'P7033', 1, 'P7033', 1, 'P7749', 1, 'P7749', 1, 'P7818', 4, 'P7818', 4, 'P8309', 1, 'P8309', 1, 'P8408', 10, 'P8408', 10, 'P8785', 2, 'P8785', 2, 'P8814', 2, 'P8814', 2, 'P18', 46, 'P17', 47, 'P21', 1, 'P10', 1]\n",
      "466\n"
     ]
    }
   ],
   "source": [
    "#Se obtienen el numero de instancias de cada una de las propiedades\n",
    "sparql5 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "sparql5.setQuery(\"\"\"SELECT DISTINCT ?p (COUNT( DISTINCT ?s) as ?sCount)\n",
    "WHERE\n",
    "{\n",
    "?s wdt:P31 wd:\"\"\"+clase+\"\"\" .\n",
    "?s ?p ?o .\n",
    "}\n",
    "GROUP BY ?p\n",
    "\"\"\")\n",
    "sparql5.setReturnFormat(JSON)\n",
    "results = sparql5.query().convert()\n",
    "\n",
    "lista_numero_propiedades = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    if len(result[\"p\"][\"value\"]) == 33:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][29:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 40:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][36:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 51:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][47:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 34:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][29:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 39:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][36:])  \n",
    "    elif len(result[\"p\"][\"value\"]) == 32:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][29:]) \n",
    "    elif len(result[\"p\"][\"value\"]) == 41:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][36:]) \n",
    "    elif len(result[\"p\"][\"value\"]) == 42:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][35:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 52:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][47:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 35:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][29:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 25:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][19:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 30:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][24:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 44:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][29:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 36:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][29:])\n",
    "    elif len(result[\"p\"][\"value\"]) == 52:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][47:])\n",
    "    else:\n",
    "        lista_numero_propiedades.append(result[\"p\"][\"value\"][34:])\n",
    "    lista_numero_propiedades.append(int(result[\"sCount\"][\"value\"]))\n",
    "\n",
    "print(lista_numero_propiedades)\n",
    "print(len(lista_numero_propiedades))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 380,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Lista a ordenar:  ['P571', 11, 'P582', 2, 'P580', 5, 'P585', 3, 'P625', 1, 'P1132', 2, 'P1350', 1, 'P1705', 3, 'P1872', 1, 'P1873', 1, 'P2521', 1, 'P2561', 1]\n",
      "Lista ordenada:  ['P571', 'P580', 'P585', 'P1705', 'P582', 'P1132', 'P625', 'P1350', 'P1872', 'P1873', 'P2521', 'P2561']\n"
     ]
    }
   ],
   "source": [
    "lista_a_representar = []\n",
    "for data_prop in range(0,len(lista_numero_propiedades)):\n",
    "    if lista_numero_propiedades[data_prop] in lista_data_properties_id:\n",
    "        if lista_numero_propiedades[data_prop] not in lista_a_representar:\n",
    "            lista_a_representar.append(lista_numero_propiedades[data_prop])\n",
    "            lista_a_representar.append(lista_numero_propiedades[data_prop+1])\n",
    "print(\"Lista a ordenar: \", lista_a_representar)\n",
    "\n",
    "lista_numero_instancias = []\n",
    "lista_propiedades_representar = []\n",
    "for ele in range(0,len(lista_a_representar)):\n",
    "    if ele % 2 != 0:\n",
    "        lista_numero_instancias.append(lista_a_representar[ele])\n",
    "    else:\n",
    "        lista_propiedades_representar.append(lista_a_representar[ele])\n",
    "\n",
    "lista_final=[]\n",
    "for ele in range(0,len(lista_numero_instancias)):\n",
    "    pos_max = lista_numero_instancias.index(max(lista_numero_instancias))\n",
    "    lista_final.append(lista_propiedades_representar[pos_max])      \n",
    "    lista_numero_instancias.remove(lista_numero_instancias[pos_max])\n",
    "    lista_propiedades_representar.remove(lista_propiedades_representar[pos_max])\n",
    "print(\"Lista ordenada: \", lista_final)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 381,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['fecha de fundación o creación (P571)', 'fecha de inicio (P580)', 'fecha (P585)', 'nombre en la lengua nativa (P1705)', 'fecha de fin (P582)', 'número de participantes (P1132)']\n"
     ]
    }
   ],
   "source": [
    "lista_a_meter_en_caja = [lista_final[0],lista_final[1],lista_final[2],lista_final[3],lista_final[4],lista_final[5]]\n",
    "lista_a_meter_en_caja_label = []\n",
    "for prop in lista_a_meter_en_caja:\n",
    "    #Se obtienen las etiquetas\n",
    "    sparql5 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "    sparql5.setQuery(\"\"\"SELECT  *\n",
    "    WHERE {\n",
    "    wd:\"\"\"+prop+\"\"\" rdfs:label ?label .\n",
    "    FILTER (langMatches( lang(?label), '\"\"\"+idioma+\"\"\"' ) )\n",
    "    } \n",
    "    LIMIT 1\n",
    "    \"\"\")\n",
    "    sparql5.setReturnFormat(JSON)\n",
    "    results = sparql5.query().convert()\n",
    "    lista_label = []\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "         lista_label.append(result[\"label\"][\"value\"])\n",
    "    if(lista_label != []):\n",
    "        for ele2 in lista_label:\n",
    "            label = ele2\n",
    "        label = label + \" (\"+prop+\")\"\n",
    "        lista_a_meter_en_caja_label.append(label)\n",
    "print(lista_a_meter_en_caja_label)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 382,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<mxfile agent=\"5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.75 Safari/537.36\" etag=\"d2m_BCRs5NTD1uJDUOON\" host=\"app.diagrams.net\" modified=\"2020-11-05T11:56:57.085Z\" type=\"device\" version=\"13.9.1\"><diagram id=\"E2t0QyFFZp_JITEdpmB3\"><mxGraphModel arrows=\"1\" connect=\"1\" dx=\"21749\" dy=\"18481\" fold=\"1\" grid=\"1\" gridSize=\"10\" guides=\"1\" math=\"0\" page=\"1\" pageHeight=\"1169\" pageScale=\"1\" pageWidth=\"827\" shadow=\"0\" tooltips=\"1\"><root><mxCell id=\"0\" /><mxCell id=\"1\" parent=\"0\" /><mxCell id=\"2\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1;fillColor=#fff2cc;strokeColor=#d6b656\" value=\"deporte (Q349)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-18500\" y=\"-16200\" /></mxCell><mxCell id=\"3\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1;align=left;dashed=1\" value=\"fecha de fundación o creación (P571)&lt;br&gt;fecha de inicio (P580)&lt;br&gt;fecha (P585)&lt;br&gt;nombre en la lengua nativa (P1705)&lt;br&gt;fecha de fin (P582)&lt;br&gt;número de participantes (P1132)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"85\" width=\"212\" x=\"-18500\" y=\"-16173\" /></mxCell><mxCell edge=\"1\" id=\"4\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"5\" value=\"ubicación (P276)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"5\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"región geográfica (Q82794)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-20650\" y=\"-16280\" /></mxCell><mxCell id=\"6\" parent=\"1\" style=\"ellipse;whiteSpace=wrap;html=1;aspect=fixed;fontSize=17;\" value=\"&lt;span class=&quot;st&quot;&gt;U&lt;/span&gt;\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"30\" width=\"30\" x=\"-20440\" y=\"-16330\" /></mxCell><mxCell edge=\"1\" id=\"7\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"6\" value=\"país de origen (P495)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell edge=\"1\" id=\"8\" parent=\"1\" source=\"6\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"10\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell edge=\"1\" id=\"9\" parent=\"1\" source=\"6\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"11\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"10\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"país (Q6256)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-20500\" y=\"-16430\" /></mxCell><mxCell id=\"11\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"Estado desaparecido (Q3024240)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-20450\" y=\"-16480\" /></mxCell><mxCell edge=\"1\" id=\"12\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"13\" value=\"deporte (P641)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"13\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"tipo de deporte (Q31629)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-20300\" y=\"-16630\" /></mxCell><mxCell edge=\"1\" id=\"14\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"15\" value=\"categoría principal del tema (P910)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"15\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"categoría de Wikimedia (Q4167836)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-20150\" y=\"-16780\" /></mxCell><mxCell edge=\"1\" id=\"16\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"17\" value=\"regulado por (P3719)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"17\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"organización (Q43229)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-20000\" y=\"-16930\" /></mxCell><mxCell edge=\"1\" id=\"18\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"19\" value=\"mantenido por el wikiproyecto (P6104)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"19\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"wikiproyecto (Q16695773)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-19850\" y=\"-17080\" /></mxCell><mxCell id=\"20\" parent=\"1\" style=\"ellipse;whiteSpace=wrap;html=1;aspect=fixed;fontSize=17;\" value=\"&lt;span class=&quot;st&quot;&gt;U&lt;/span&gt;\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"30\" width=\"30\" x=\"-19640\" y=\"-17130\" /></mxCell><mxCell edge=\"1\" id=\"21\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"20\" value=\"país (P17)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell edge=\"1\" id=\"22\" parent=\"1\" source=\"20\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"25\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell edge=\"1\" id=\"23\" parent=\"1\" source=\"20\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"26\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell edge=\"1\" id=\"24\" parent=\"1\" source=\"20\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"27\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"25\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"país (Q6256)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-19700\" y=\"-17230\" /></mxCell><mxCell id=\"26\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"federación (Q43702)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-19650\" y=\"-17280\" /></mxCell><mxCell id=\"27\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"Estado desaparecido (Q3024240)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-19600\" y=\"-17330\" /></mxCell><mxCell id=\"28\" parent=\"1\" style=\"ellipse;whiteSpace=wrap;html=1;aspect=fixed;fontSize=17;\" value=\"&lt;span class=&quot;st&quot;&gt;U&lt;/span&gt;\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"30\" width=\"30\" x=\"-19390\" y=\"-17380\" /></mxCell><mxCell edge=\"1\" id=\"29\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"28\" value=\"industria (P452)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell edge=\"1\" id=\"30\" parent=\"1\" source=\"28\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"32\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell edge=\"1\" id=\"31\" parent=\"1\" source=\"28\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"33\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"32\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"industria (Q268592)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-19450\" y=\"-17480\" /></mxCell><mxCell id=\"33\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"actividad económica (Q8187769)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-19400\" y=\"-17530\" /></mxCell><mxCell edge=\"1\" id=\"34\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"35\" value=\"cultura (P2596)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell id=\"35\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"etnia (Q41710)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-19250\" y=\"-17680\" /></mxCell><mxCell id=\"36\" parent=\"1\" style=\"rounded=0;whiteSpace=wrap;html=1\" value=\"ser humano (Q5)\" vertex=\"1\"><mxGeometry as=\"geometry\" height=\"27\" width=\"212\" x=\"-18900\" y=\"-16020\" /></mxCell><mxCell edge=\"1\" id=\"37\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"36\" value=\"presidente (P488)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell><mxCell edge=\"1\" id=\"38\" parent=\"1\" source=\"2\" style=\"edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;\" target=\"36\" value=\"creador (P170)\"><mxGeometry as=\"geometry\" relative=\"1\" /></mxCell></root></mxGraphModel></diagram></mxfile>\n"
     ]
    }
   ],
   "source": [
    "a=ET.Element('mxfile')\n",
    "a.set('type','device')\n",
    "a.set('etag','d2m_BCRs5NTD1uJDUOON')\n",
    "a.set('version','13.9.1')\n",
    "a.set('agent','5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.75 Safari/537.36')\n",
    "a.set('modified','2020-11-05T11:56:57.085Z')\n",
    "a.set('host','app.diagrams.net')\n",
    "\n",
    "b = ET.SubElement(a, 'diagram')\n",
    "b.set('id','E2t0QyFFZp_JITEdpmB3')\n",
    "\n",
    "c = ET.SubElement(b, 'mxGraphModel')\n",
    "c.set('shadow','0')\n",
    "c.set('math','0')\n",
    "c.set('pageHeight','1169')\n",
    "c.set('pageWidth','827')\n",
    "c.set('pageScale','1')\n",
    "c.set('page','1')\n",
    "c.set('fold','1')\n",
    "c.set('arrows','1')\n",
    "c.set('connect','1')\n",
    "c.set('tooltips','1')\n",
    "c.set('guides','1')\n",
    "c.set('gridSize','10')\n",
    "c.set('grid','1')\n",
    "c.set('dy','18481')\n",
    "c.set('dx','21749')\n",
    "\n",
    "d = ET.SubElement(c, 'root')\n",
    "\n",
    "e = ET.SubElement(d, 'mxCell')\n",
    "e.set('id','0')\n",
    "f = ET.SubElement(d, 'mxCell')\n",
    "f.set('id','1')\n",
    "f.set('parent','0')\n",
    "\n",
    "#Caja con la clase inicial\n",
    "sparql6 = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "sparql6.setQuery(\"\"\"SELECT  *\n",
    "WHERE {\n",
    "wd:\"\"\"+clase+\"\"\" rdfs:label ?label .\n",
    "FILTER (langMatches( lang(?label), '\"\"\"+idioma+\"\"\"' ) )\n",
    "} \n",
    "LIMIT 1\n",
    "\"\"\")\n",
    "sparql6.setReturnFormat(JSON)\n",
    "results = sparql6.query().convert()\n",
    "lista_label = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    lista_label.append(result[\"label\"][\"value\"])\n",
    "for ele2 in lista_label:\n",
    "    label = ele2\n",
    "label = label + \" (\"+clase+\")\"\n",
    "    \n",
    "g = ET.SubElement(d, 'mxCell')\n",
    "g.set('id','2')\n",
    "g.set('parent','1')\n",
    "g.set('style','rounded=0;whiteSpace=wrap;html=1;fillColor=#fff2cc;strokeColor=#d6b656')\n",
    "g.set('vertex','1')\n",
    "g.set('value',label)\n",
    "g1 = ET.SubElement(g, 'mxGeometry')\n",
    "g1.set('as','geometry')\n",
    "g1.set('y','-16200')\n",
    "g1.set('x','-18500')\n",
    "g1.set('height','27')\n",
    "g1.set('width','212')\n",
    "\n",
    "#Caja con los dataType Strings\n",
    "aj = ET.SubElement(d,'mxCell')\n",
    "aj.set('id','3')\n",
    "aj.set('parent','1')\n",
    "aj.set('style','rounded=0;whiteSpace=wrap;html=1;align=left;dashed=1')\n",
    "aj.set('vertex','1')\n",
    "aj.set('value',lista_a_meter_en_caja_label[0]+'<br>'+lista_a_meter_en_caja_label[1]+'<br>'+lista_a_meter_en_caja_label[2]\n",
    "      +'<br>'+lista_a_meter_en_caja_label[3]+'<br>'+lista_a_meter_en_caja_label[4]+'<br>'+lista_a_meter_en_caja_label[5])\n",
    "aj1=ET.SubElement(aj,'mxGeometry')\n",
    "aj1.set('as','geometry')\n",
    "aj1.set('y','-16173')\n",
    "aj1.set('x','-18500')\n",
    "aj1.set('height','85')\n",
    "aj1.set('width','212')\n",
    "\n",
    "x=-20700\n",
    "y=-16230\n",
    "iteracion = 0\n",
    "identificador = 4\n",
    "for i in range(0,len(lista_varias_clases_una_propiedad)):\n",
    "    \n",
    "    #Para las propiedades\n",
    "    if iteracion % 2 == 0:\n",
    "        #Si tiene que enlazar con mas de una clase\n",
    "        if len(lista_varias_clases_una_propiedad[i+1]) > 1:\n",
    "            #Simbolo de union\n",
    "            ak = ET.SubElement(d,'mxCell')\n",
    "            ak.set('id',str(identificador))\n",
    "            ak.set('parent','1')\n",
    "            ak.set('style','ellipse;whiteSpace=wrap;html=1;aspect=fixed;fontSize=17;')\n",
    "            ak.set('vertex','1')\n",
    "            ak.set('value','<span class=\"st\">U</span>')\n",
    "            ak1=ET.SubElement(ak,'mxGeometry')\n",
    "            ak1.set('as','geometry')\n",
    "            ak1.set('y',str(y+50))\n",
    "            ak1.set('x',str(x+110))\n",
    "            ak1.set('height','30')\n",
    "            ak1.set('width','30')\n",
    "            \n",
    "            union = identificador\n",
    "            identificador = identificador + 1\n",
    "            \n",
    "            #Flecha con la propiedad\n",
    "            bk = ET.SubElement(d, 'mxCell')\n",
    "            bk.set('id',str(identificador))\n",
    "            bk.set('parent','1')\n",
    "            bk.set('target',str(identificador-1))\n",
    "            bk.set('source','2')\n",
    "            bk.set('edge','1')\n",
    "            bk.set('style','edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;')\n",
    "            bk.set('value',lista_varias_clases_una_propiedad[i])\n",
    "            bk1 = ET.SubElement(bk, 'mxGeometry')\n",
    "            bk1.set('as','geometry')\n",
    "            bk1.set('relative','1')\n",
    "            \n",
    "            identificador = identificador + 1\n",
    "\n",
    "            for ele in lista_varias_clases_una_propiedad[i+1]:\n",
    "                #Flecha con la propiedad\n",
    "                ck = ET.SubElement(d, 'mxCell')\n",
    "                ck.set('id',str(identificador))\n",
    "                ck.set('parent','1')\n",
    "                ck.set('target',str(identificador+len(lista_varias_clases_una_propiedad[i+1])))\n",
    "                ck.set('source',str(union))\n",
    "                ck.set('edge','1')\n",
    "                ck.set('style','edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;')\n",
    "                ck1 = ET.SubElement(ck, 'mxGeometry')\n",
    "                ck1.set('as','geometry')\n",
    "                ck1.set('relative','1')\n",
    "                identificador = identificador + 1\n",
    "            identificador = identificador - 1\n",
    "        \n",
    "        #Si solo tiene que enlazar con una clase\n",
    "        if len(lista_varias_clases_una_propiedad[i+1]) == 1:\n",
    "            #Estamos tratando una propiedad\n",
    "            #Flecha con la propiedad\n",
    "            k = ET.SubElement(d, 'mxCell')\n",
    "            k.set('id',str(identificador))\n",
    "            k.set('parent','1')\n",
    "            k.set('target',str(identificador+1))\n",
    "            k.set('source','2')\n",
    "            k.set('edge','1')\n",
    "            k.set('style','edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;')\n",
    "            k.set('value',lista_varias_clases_una_propiedad[i])\n",
    "            k1 = ET.SubElement(k, 'mxGeometry')\n",
    "            k1.set('as','geometry')\n",
    "            k1.set('relative','1')\n",
    "    \n",
    "    #Para las clases\n",
    "    else:\n",
    "        #Estamos tratando una lista de clases\n",
    "        num_elem = 1\n",
    "        for j in lista_varias_clases_una_propiedad[i]:\n",
    "            if num_elem > 1:\n",
    "                identificador = identificador +1\n",
    "            #Caja con clase\n",
    "            z = ET.SubElement(d, 'mxCell')\n",
    "            z.set('id',str(identificador))\n",
    "            z.set('parent','1')\n",
    "            z.set('style','rounded=0;whiteSpace=wrap;html=1')\n",
    "            z.set('vertex','1')\n",
    "            z.set('value',j)\n",
    "            z1 = ET.SubElement(z, 'mxGeometry')\n",
    "            z1.set('as','geometry')\n",
    "            z1.set('y',str(y))\n",
    "            z1.set('x',str(x))\n",
    "            z1.set('height','27')\n",
    "            z1.set('width','212')\n",
    "            num_elem = num_elem + 1\n",
    "            x=x+50\n",
    "            y=y-50\n",
    "       \n",
    "    x=x+50\n",
    "    y=y-50\n",
    "    iteracion = iteracion + 1\n",
    "    identificador = identificador + 1\n",
    "\n",
    "x1 = -18900\n",
    "y1 = -16020\n",
    "clase2 = 0\n",
    "for i in range(0,len(lista_varias_propiedades_una_clase)):\n",
    "    res = isinstance(lista_varias_propiedades_una_clase[i], str) \n",
    "    #Si son propiedades\n",
    "    if str(res) == \"True\":\n",
    "        #Flecha con la propiedad\n",
    "        bk = ET.SubElement(d, 'mxCell')\n",
    "        bk.set('id',str(identificador))\n",
    "        bk.set('parent','1')\n",
    "        bk.set('target',str(clase2))\n",
    "        bk.set('source','2')\n",
    "        bk.set('edge','1')\n",
    "        bk.set('style','edgeStyle=orthogonalEdgeStyle;rounded=0;orthogonalLoop=1;jettySize=auto;html=1;exitX=1;exitY=0.5;exitDx=0;exitDy=0;dashed=1;endArrow=classic;endFill=1;')\n",
    "        bk.set('value',str(lista_varias_propiedades_una_clase[i]))\n",
    "        bk1 = ET.SubElement(bk, 'mxGeometry')\n",
    "        bk1.set('as','geometry')\n",
    "        bk1.set('relative','1')\n",
    "        identificador = identificador + 1\n",
    "    #Si son clases\n",
    "    else:\n",
    "        #Caja con la clase\n",
    "        z = ET.SubElement(d, 'mxCell')\n",
    "        z.set('id',str(identificador))\n",
    "        z.set('parent','1')\n",
    "        z.set('style','rounded=0;whiteSpace=wrap;html=1')\n",
    "        z.set('vertex','1')\n",
    "        z.set('value',str(lista_varias_propiedades_una_clase[i][0]))\n",
    "        z1 = ET.SubElement(z, 'mxGeometry')\n",
    "        z1.set('as','geometry')\n",
    "        z1.set('y',str(y1))\n",
    "        z1.set('x',str(x1))\n",
    "        z1.set('height','27')\n",
    "        z1.set('width','212')\n",
    "        clase2 = identificador\n",
    "        identificador = identificador + 1\n",
    "        x1 = x1 - 50\n",
    "        y1 = y1 + 50\n",
    "ET.dump(a)\n",
    "tree = ET.ElementTree(a)\n",
    "tree.write(\"output_final.xml\", encoding='utf-8', xml_declaration=True)                       "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
